vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32570</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32570 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
   
      <release version="0.3.0" date="2022-03-29">
      	-Fixed issues based on new Keil gen-pack Script files
      </release> 
   
      <release version="0.2.0" date="2020-04-09">
      	-SDK Released
      </release> 
 
      <release version="0.1.4" date="2020-04-05">
      	-Initial Limited release of SDK
      </release> 
 
      <release version="0.1.3" date="2020-03-24">
      	-Initial Limited release of SDK, some examples under construction
      </release>  
   
      <release version="0.1.2" date="2020-03-16">
      	-Initial Limited release of SDK, some examples still in construction
      </release>
   
      <release version="0.1.1" date="2020-01-30">
      	-Initial limited release of SDK
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32570</keyword>
      <keyword>MAX32571</keyword>	  
      <keyword>MAX32570 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32570-71" Dvendor="Maxim:23">
         <book name="Doc/MAX32570_datasheet.txt" title="MAX32570 Family Data Sheet"/>
         <book name="Doc/MAX32570_userguide.txt" title="MAX32570 Family Users Guide"/>         
         <!-- <compile header="Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.h" /> -->
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.h" define="MAX32570"/>
         <memory name="IROM1" access="rx" start="0x10000000" size="0x00100000" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00080000" init="0" default="1"/>
         <algorithm name="Flash/MAX32570.FLM" start="0x10000000" size="0x00100000" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32570.flash" start="0x10000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00080000" default="0" style="IAR"/>
         <description>
         	DARWIN is a new breed of low-power microcontrollers built to thrive in the rapidly evolving Internet of Things (IoT). They are smart, with the biggest memories in their class, and a massively scalable memory architecture. They run forever, thanks to wearable-grade power technology. They are durable enough to withstand the most advanced cyberattacks. DARWIN microcontrollers are designed to run any application imaginable - in places where you would not dream of sending other microcontrollers. 
         	Generation UB microcontrollers are designed to handle the increasingly complex applications demanded by today's advanced battery powered devices and wirelessly connected devices, while providing robust hardware security and Bluetooth(R) 5 Low Energy (BLE) radio connectivity.
         	The MAX32570 UB class microcontrollers are advanced systems-on-chips featuring an Arm(R) Cortex(R)-M4 with FPU CPU for efficient computation of complex functions and algorithms with integrated power management. They also include the newest generation Bluetooth 5 Low Energy radio with support for long range (4x) and high throughput (2Mbps) and Maxim's best-in-class hardware security suite trust protection unit (TPU). The devices offer large on-board memory with 1MB flash and up to 560KB STAM that can be configured as 447KB SRAM with error correction coding (ECC). Split flash banks and 512KB each support seamless over the air upgrades, adding an additional degree of reliability. Memory scalability of data (SRAM) and code (flash) space is supported two SPI execute-in-place (SPIX) interfaces. 
         	Multiple high-speed interfaces are supported included HS_USB, secure digital interface (SD, SDIO, MMC, SDHC, and microSD(tm)), SPI, UART, and I2C serial interfaces, and TDM interfaces. An 8-input 10-bit ADC is available to monitor analog inputs from external sensors and meters. The devices are available in 109-bump WLP (0.35mm pitch) and 121-bump CTBGA (0.65mm pitch) packages.
         </description>     
         <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/>
         <debug svd="SVD/MAX32570/max32570.svd" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32570">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>
		 
         <device Dname="MAX32571">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>		 
      </family>
   </devices>

   <!-- MAX32570 Evaluation Kit Board Support Package -->
   <boards>  <!-- Faisal I am not sure what is going on here -->
      <board vendor="Maxim" name="MAX32570 EvKit" revision="Rev A" salesContact="sales@maximintegrated.com">
         <description>The MAX32570 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32570 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32570_EvKit.txt" title="MAX32570 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32570_EvKitSchematic.txt" title="MAX32570 EvKit Schematic"/>
         <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32571"/>
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32570"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>

