vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
   <!-- Evaluation Kit Example Programs -->
   <examples>
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
         <!--   <environment name="uv" load="ARM/Hello_World.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  <example name="GPIO" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/GPIO.ewp" />
         <!-- <environment name="uv" load="ARM/GPIO.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  <example name="ADC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/ADC">
         <description>Analog to Digital Converter Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ADC.ewp" />
        <!-- <environment name="uv" load="ARM/ADC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ADC"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
      <example name="AES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/AES">
         <description>AES Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
            <!-- <environment name="uv" load="ARM/AES.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  <example name="Barcode_Decoder" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Barcode_Decoder">
         <description>Barcode Decoder Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
            <!-- <environment name="uv" load="ARM/AES.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="CameraIF" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/CameraIF">
         <description>CameraIF Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CameraIF.ewp" />
         <!--   <environment name="uv" load="ARM/CameraIF.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="CRC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
         <!--  <environment name="uv" load="ARM/CRC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="DES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/DES">
         <description>DES Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DES.ewp" />
         <!--   <environment name="uv" load="ARM/DES.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="DMA" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/DMA">
         <description>DMA Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
         <!--   <environment name="uv" load="ARM/DMA.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Flash" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Flash">
         <description>Flash Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Flash.ewp" />
         <!--   <environment name="uv" load="ARM/Flash.uvprojx" />  -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="FLC"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="FreeRTOSDemo" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/FreeRTOSDemo">
         <description>FreeRTOS Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/FreeRTOSDemo.ewp" />
         <!--   <environment name="uv" load="ARM/FreeRTOSDemo.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Hash" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Hash">
         <description>Hash Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hash.ewp" />
         <!--   <environment name="uv" load="ARM/Hash.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="HTMR" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/HTMR">
         <description>HTMR Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/HTMR.ewp" />
         <!--   <environment name="uv" load="ARM/HTMR.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="I2C" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/I2C">
         <description>I2C Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2C.ewp" />
         <!--   <environment name="uv" load="ARM/I2C.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2C"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="ICC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/ICC">
         <description>Instruction Cache Controller Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ICC.ewp" />
        <!-- <environment name="uv" load="ARM/ICC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ICC"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>      
      <example name="LP" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/LP">
         <description>Low Power Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/LP.ewp" />
         <!--   <environment name="uv" load="ARM/LP.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="lwIP_Ping" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/lwIP_Ping">
         <description>LwIP_Ping Ethernet</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/lwIP_Ping.ewp" />
            <!-- <environment name="uv" load="ARM/lwIP_Ping.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="lwIP_TCP" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/lwIP_TCP">
         <description>lwIP_TCP Ethernet</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/lwIP_TCP.ewp" />
           <!-- <environment name="uv" load="ARM/lwIP_TCP.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="OWM" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/OWM">
         <description>One Wire Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/OWM.ewp" />
            <!-- <environment name="uv" load="ARM/OWM.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Pulse_Train" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Pulse_Train">
         <description>Pulse Train Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Pulse_Train.ewp" />
         <!--   <environment name="uv" load="ARM/Pulse_Train.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Pulse Train"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="RTC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/RTC">
         <description>RTC Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/RTC.ewp" />
         <!--   <environment name="uv" load="ARM/RTC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="RTC" />
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SDHC_FAT" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SDHC_FAT">
         <description>SCHC_FAT Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SDHC_FAT.ewp" />
         <!--   <environment name="uv" load="ARM/SDHC_FAT.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SDHC" />
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SDHC_Raw" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SDHC_Raw">
         <description>SDHC_Raw Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SDHC_Raw.ewp" />
         <!--   <environment name="uv" load="ARM/SDHC_Raw.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SDHC" />
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Semaphore" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Semaphore">
         <description>Semaphore Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Semaphore.ewp" />
         <!--   <environment name="uv" load="ARM/Semaphore.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="SKB" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SKB">
         <description>Secure Keyboard Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SKB.ewp" />
         <!--   <environment name="uv" load="ARM/SKB.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SPI" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SPI">
         <description>SPI Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI.ewp" />
         <!--   <environment name="uv" load="ARM/SPI.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SPI_Touchscreen" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SPI_Touchscreen">
         <description>SPI Touchscreen Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI_Touchscreen.ewp" />
         <!--   <environment name="uv" load="ARM/SPI_Touchscreen.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SPIXF" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SPIXF">
         <description>SPIXF Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
