vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
            <environment name="iar" load="IAR/SPIXF.ewp" />
         <!--   <environment name="uv" load="ARM/SPIXF.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SPIXR" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SPIXR">
         <description>SPIXR World Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPIXR.ewp" />
         <!--   <environment name="uv" load="ARM/SPIXR.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="SRCC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/SRCC">
         <description>SPIXR Cache Controller Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SRCC.ewp" />
         <!--   <environment name="uv" load="ARM/SRCC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="TMR" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/TMR">
         <description>Timer Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
         <!--   <environment name="uv" load="ARM/TMR.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="TRNG" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/TRNG">
         <description>True Random Number Generator</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
         <!--   <environment name="uv" load="ARM/TRNG.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="UART" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/UART">
         <description>UART Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
         <!--   <environment name="uv" load="ARM/UART.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="USB_CDCACM" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/USB_CDCACM">
         <description>USB CDCACM Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CDCACM.ewp" />
         <!--   <environment name="uv" load="ARM/USB_CDCACM.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
      <example name="USB_CompositeDevice_MSC_CDC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/USB_CompositeDevice_MSC_CDC">
         <description>USB Composite Device MSC CDC Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CompositeDevice_MSC_CDC.ewp" />
         <!--   <environment name="uv" load="ARM/USB_CompositeDevice_MSC_CDC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="USB_CompositeDevice_MSC_HID" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/USB_CompositeDevice_MSC_HID">
         <description>USB Composite Device MSC HIDDemo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CompositeDevice_MSC_HID.ewp" />
         <!--   <environment name="uv" load="ARM/USB_CompositeDevice_MSC_HID.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="USB_HIDKeyboard" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/USB_HIDKeyboard">
         <description>USB HID Keyboard Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_HIDKeyboard.ewp" />
         <!--   <environment name="uv" load="ARM/USB_HIDKeyboard.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="USB_MassStorage" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/USB_MassStorage">
         <description>USB Mass Storage Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_MassStorage.ewp" />
         <!--   <environment name="uv" load="ARM/USB_MassStorage.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32570_EVKIT/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32570 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
         <!--   <environment name="uv" load="ARM/Watchdog.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32570 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32570 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
   </examples>

   <conditions>
      <!-- MAX32570 Device Condition -->
      <condition id="MAX32570 Family">
         <description> Maxim Integrated MAX32570 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX3257*"/>		 
         <!-- <require Dfamily="MAX32570-71"/> -->
      </condition>

      <!-- MAX32570 Device Condition - TPU Enabled Part -->
      <condition id="MAX32570 Device">
         <description> Maxim Integrated MAX32570 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32570"/>
      </condition>

