vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
      <!-- MAX32571 Device Condition - TPU Enabled Part -->
      <condition id="MAX32571 Device">
         <description> Maxim Integrated MAX32570 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32571"/>
      </condition>

      <!-- MAX32570/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32570 CMSIS-CORE">
         <description>Maxim MAX32570 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32570 Family"/>
         <accept condition="MAX32571 Device"/>
		 <accept condition="MAX32570 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
   <!--   <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> -->
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32570 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>
	  
      <!-- CAMERAIF Peripheral Condition -->
      <condition id="MAX32570 CMSIS CAMERAIF">
         <description>CAMERAIF</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>	
	
      <!-- CTB Peripheral Condition -->
      <condition id="MAX32570 CMSIS CTB">
         <description>CTB</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>		  

      <!-- EMAC Peripheral Condition -->
      <condition id="MAX32570 CMSIS EMAC">
         <description>EMAC</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>	

      <!-- Standard DMA Peripheral -->
      <condition id="MAX32570 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32570 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32570 CMSIS-CORE"/>
         <require condition="MAX32570 CMSIS ICC"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32570 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- OWM -->
      <condition id="MAX32570 CMSIS OWM">
         <description>1-Wire Master Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- PT -->
      <condition id="MAX32570 CMSIS PT">
         <description>Pulse Train Engine</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32570 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SDHC -->
      <condition id="MAX32570 CMSIS SDHC">
         <description>SD Host Controller</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SFCC -->
      <condition id="MAX32570 CMSIS SFCC">
         <description>SFCC</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>
	  
	  <!-- SKBD -->
      <condition id="MAX32570 CMSIS SKBD">
         <description>SKBD</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>
	  
	  <!-- SMON -->
      <condition id="MAX32570 CMSIS SMON">
         <description>SMON</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32570 CMSIS SPI XIP RAM">
         <description>SPI-XiP RAM (SPID) Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SRCC Peripheral -->
      <condition id="MAX32570 CMSIS SRCC">
         <description>SRCC</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>      


      <!-- SPI Peripheral -->
      <condition id="MAX32570 CMSIS SPI XIP FLASH">
         <description>SPI-XiP Flash (SPIX) Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32570 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32570 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32570 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32570 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- WUT -->
 <!--     <condition id="MAX32570 CMSIS WUT">
         <description>Wakeup Timers</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition> -->

      <!-- Low Power -->
      <condition id="MAX32570 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- SEMA -->
      <condition id="MAX32570 CMSIS SEMA">
         <description>Semaphore Module</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

