vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
      <!-- GPIO -->
      <condition id="MAX32570 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32570 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>

      <!-- HTMR -->
      <condition id="MAX32570 CMSIS HTMR">
         <description>HTimer</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition> 

      <!-- SIMO -->
 <!--     <condition id="MAX32570 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition> -->

      <!-- DualCore -->
 <!--     <condition id="MAX32570 CMSIS DualCore">
         <description>DualCore</description>
         <require condition="MAX32570 CMSIS-CORE"/>
         <accept condition="MAX32570 Device"/>
		 <accept condition="MAX32571 Device"/>
      </condition> -->

 <!--     <condition id="MAX32570 CMSIS TPU">
         <description>TPU Device Class</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>      -->

      <condition id="MAXUSB Core DEP">
         <description>MAXUSB HS Core</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>      

      <condition id="MAXUSB DevClass DEP">
         <description>MAXUSB Device Class</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>        

      <condition id="LWIP Core DEP">
         <description>LWIP Freeware</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>
	

 <!--     <condition id="FatFs DEP">
         <description>FatFs Dependencies</description>
         <require condition="MAX32570 CMSIS-CORE"/>
      </condition>             -->

      <condition id="MAX32570 BSP DEP">
         <description>Board Support Package</description>
         <!-- <require condition="MAX32570 CMSIS-CORE"/> -->
         <accept condition="MAX32570 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="XiP Flash"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
   </conditions>

   <components>
<!--   
        <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="0.3.0" condition="MAX32570 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32570   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
        </component>
        <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="0.3.0" condition="MAX32570 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32570   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component>
-->
      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="0.3.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32570 Device Selection -->
         <component Cgroup="Startup" Cversion="0.3.0" condition="MAX32570 Family" >
            <description>System Startup for Maxim MAX32570 Microcontroller</description>
			
		<!--	
            <RTE_Components_h>
                  #define TARGET 32570   /* Target Device Part Number */
                  #define TARGET_REV 0x4131 /* Target Device Revision Number */
            </RTE_Components_h>  -->
			
         <!--   <component Cclass="Target Rev" Cvariant="A1" Cversion="0.3.0">
                 <description>Target Rev A1 selected</description>
                 <RTE_Components_h>
			      #define TARGET 32570   /* Target Device Part Number */
                  #define TARGET_REV 0x4131       /* A1 chip */
                 </RTE_Components_h>
            </component>
            <component Cclass="Target Rev" Cvariant="A2" Cversion="0.3.0">
                 <description>Target Rev A2 selected</description>
                 <RTE_Components_h>
			     #define TARGET 32570   /* Target Device Part Number */
                 #define TARGET_REV 0x4132       /* A2 chip */
                 </RTE_Components_h>
            </component>		          -->	
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32570/Include/" version="0.3.0" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32570/" version="0.3.0" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/ADC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CAMERAIF/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CTB/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/EMAC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/HTMR/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/OWM/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/PT/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SDHC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SEMA/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SFCC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SMON/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPIXF/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPIXR/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SRCC/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="0.3.0"/>

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->
			   <!--
               <file category="sourceAsm" attr="config" version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/ARM/startup_max32570.s" condition="Startup ARM" />
			   -->
               
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/GCC/startup_max32570.S" condition="Startup GCC" />

