vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
               <!-- IAR device startup file, low level init and cmain.s -->
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/IAR/startup_max32570.s" condition="Startup IAR" version="0.3.0" />
               <file category="sourceC" attr="config"  version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/IAR/cmain.s" condition="Startup IAR" />
               <file category="sourceC" attr="config"  version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/sla_header.c" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="0.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32570/Source/system_max32570.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="0.3.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.h" version="0.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me13.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me13.c"  version="0.3.0" />
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/flc.c"  version="0.3.0" />        It has become flc_me13.c     --> 
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/cipher.c"  version="0.3.0" />          -->	
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/mem_utils.c"  version="0.3.0" />		-->		   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="0.3.0" />
			   
			   <!-- Note:- sema.c should be turned on by check box and not by the stuff shown below -->
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/sema.c" version="0.3.0"/>         It has become sema_me13.c -->



			   
			   
            </files>
         </component>

         <component Cgroup="ADC" condition="MAX32570 CMSIS ADC" Cversion="0.3.0"> 
         	 <description>ADC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_common.c" version="0.3.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_reva.c" version="0.3.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="CAMERAIF" condition="MAX32570 CMSIS CAMERAIF" Cversion="0.3.0"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CAMERAIF/cameraif_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CAMERAIF/cameraif_reva.c" version="0.3.0"/>
            </files>
         </component>
		 
		 <component Cgroup="CTB" condition="MAX32570 CMSIS CTB" Cversion="0.3.0"> 
         	 <description>Crypto Tool Box</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_common.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_reva.c" version="0.3.0"/>
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32570 CMSIS DMA" Cversion="0.3.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="EMAC" condition="MAX32570 CMSIS EMAC" Cversion="0.3.0" >
            <description> EMAC </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/EMAC/emac_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/EMAC/emac_reva.c" version="0.3.0"/>			   	   
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32570 CMSIS FLC" Cversion="0.3.0">
            <description>Flash Controller for Internal Flash Memory</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="0.3.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32570 CMSIS GPIO" Cversion="0.3.0">
            <description>General Purpose Input Ouptput</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="0.3.0"/>		   
            </files>
         </component>

