vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
         <component Cgroup="HTMR" condition="MAX32570 CMSIS HTMR" Cversion="0.3.0">
            <description>HTimer API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/HTMR/htmr_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/HTMR/htmr_reva.c" version="0.3.0"/>
            </files>
         </component> 

         <component Cgroup="I2C" condition="MAX32570 CMSIS I2C" Cversion="0.3.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="ICC" condition="MAX32570 CMSIS ICC" Cversion="0.3.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="0.3.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="Low Power" condition="MAX32570 CMSIS Low Power" Cversion="0.3.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me13.c" version="0.3.0"/>			   
            </files>
         </component>		 

         <component Cgroup="1-Wire" condition="MAX32570 CMSIS OWM" Cversion="0.3.0">
            <description>1-Wire Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/OWM/owm_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/OWM/owm_reva.c" version="0.3.0"/>
			   
            </files>
         </component>

         <component Cgroup="Pulse Train" condition="MAX32570 CMSIS PT" Cversion="0.3.0">
            <description>Pulse Train Engine</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="RTC" condition="MAX32570 CMSIS RTC" Cversion="0.3.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SDHC" condition="MAX32570 CMSIS SDHC" Cversion="0.3.0">
            <description>SD Host Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SDHC/sdhc_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/SDHC/sdhc_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SEMA" condition="MAX32570 CMSIS SEMA" Cversion="0.3.0">
            <description>Semaphore API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SEMA/sema_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/SEMA/sema_reva.c" version="0.3.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="SFCC" condition="MAX32570 CMSIS SFCC" Cversion="0.3.0">
            <description>SPIXF Cache Controller </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SFCC/sfcc_me13.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SKBD" condition="MAX32570 CMSIS SKBD" Cversion="0.3.0">
            <description>Secure Keyboard </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SKBD/skbd_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/SKBD/skbd_reva.c" version="0.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SKBD/" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="SMON" condition="MAX32570 CMSIS SMON" Cversion="0.3.0">
            <description>Security Monitor </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SMON/smon_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/SMON/smon_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32570 CMSIS SPI" Cversion="0.3.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me13.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="XiP Flash" condition="MAX32570 CMSIS SPI XIP FLASH" Cversion="0.3.0">
            <description>SPI eXecute In Place (XIP) Interface For External Code Execution</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXF/spixf_me13.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXF/spixf_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="XiP RAM" condition="MAX32570 CMSIS SPI XIP RAM" Cversion="0.3.0">
            <description>SPI eXecute In Place (XIP) Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXR/spixr_me13.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXR/spixr_reva.c" version="0.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SRCC" condition="MAX32570 CMSIS SRCC" Cversion="0.3.0">
            <description>SPIXR Cache Controller </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SRCC/srcc_me13.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SRCC/srcc_reva.c" version="0.3.0"/>			  
            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32570 CMSIS TIMER" Cversion="0.3.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="0.3.0"/>			   
            </files>
         </component>

