vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
         <component Cgroup="UART" condition="MAX32570 CMSIS UART" Cversion="0.3.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="0.3.0"/>
            </files>
         </component>
		 
         <component Cgroup="WDT" condition="MAX32570 CMSIS WDT" Cversion="0.3.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me13.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_reva.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="0.3.0"/>
            </files>
         </component>
      </bundle>
	  
      <bundle Cbundle="MAXUSB" Cclass="USB" Cversion="0.3.0">
         <description>Maxim Developed USB Device Stack</description>
         <doc>Libraries/MAXUSB/readme.txt</doc>
         <component Cgroup="Core" condition="MAXUSB Core DEP">
            <description>MAXUSB Core Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/core/musbhsfc/" version="0.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/core/" version="0.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/musbhsfc/usb.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="0.3.0"/>
            </files>
         </component>
         <component Cgroup="Device Class" condition="MAXUSB DevClass DEP">
            <description>MAXUSB Device Class Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/devclass/" version="0.3.0"/>
               <!-- <file category="include" name="Libraries/MAXUSB/include/util/" version="0.3.0"/> -->
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/msc.c" version="0.3.0"/>
            </files>
         </component>
      </bundle>
	 

      <bundle Cbundle="lwIP Bundle" Cclass="lwIP" Cversion="0.3.0">
         <description>LWIP Freeware</description>
		 <doc>Libraries/lwIP/Readme.txt</doc>
         <component Cgroup="Core" condition="LWIP Core DEP">
            <description>LWIP Core Files</description>
            <files>
             <!--  <file category="library" name="Libraries/lwIP/liblwip.a" version="0.3.0"/> -->
			   <file category="include" name="Libraries/lwIP/include/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/compat/" version="0.3.0"/>				   
			   <file category="include" name="Libraries/lwIP/include/compat/posix/" version="0.3.0"/>			   
			   <file category="include" name="Libraries/lwIP/include/compat/posix/arpa/" version="0.3.0"/>			   
			   <file category="include" name="Libraries/lwIP/include/compat/posix/net/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/compat/posix/sys/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/compat/stdc/" version="0.3.0"/>			   
			   <file category="include" name="Libraries/lwIP/include/lwip/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/lwip/apps/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/lwip/priv/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/lwip/prot/" version="0.3.0"/>			   			   
			   <file category="include" name="Libraries/lwIP/include/netif/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/netif/ppp/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/netif/ppp/polarssl/" version="0.3.0"/>			   
			   <file category="include" name="Libraries/lwIP/include/Maxim/" version="0.3.0"/>
			   <file category="include" name="Libraries/lwIP/include/Maxim/arch/" version="0.3.0"/>
			   
			   <file category="sourceC" name="Libraries/lwIP/api/api_lib.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/lwIP/api/api_msg.c" version="0.3.0"/>			   		   			   
			   <file category="sourceC" name="Libraries/lwIP/api/err.c" version="0.3.0"/>			   
			   <file category="sourceC" name="Libraries/lwIP/api/if_api.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/lwIP/api/netbuf.c" version="0.3.0"/>			   			   
			   <file category="sourceC" name="Libraries/lwIP/api/netdb.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/lwIP/api/netifapi.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/lwIP/api/sockets.c" version="0.3.0"/>
			   <file category="sourceC" name="Libraries/lwIP/api/tcpip.c" version="0.3.0"/>
			   
			   <file category="sourceC" name="Libraries/lwIP/core/ipv4/autoip.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/dhcp.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/etharp.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/icmp.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/igmp.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/ip4.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/ip4_addr.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/lwIP/core/ipv4/ip4_frag.c" version="0.3.0"/>
			   
