vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32570.pdsc
     <!--
      <bundle Cbundle="FatFs" Cclass="File System" Cversion="0.3.0">
         <description>FatFs lightweight Fat filesystem module</description>
         <doc>Libraries/SDHC/ff13/documents/00index_e.html</doc>
         <component Cgroup="FatFs - SDHC" condition="FatFs DEP">
            <description>FatFs File System with Maxim SDHC integration</description>
            <files>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/diskio.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ff.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffsystem.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffunicode.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/Source/sdhc_lib.c" version="0.3.0"/>
               <file category="include" name="Libraries/SDHC/Include/" version="0.3.0"/>
               <file category="include" name="Libraries/SDHC/ff13/Source/" version="0.3.0"/>
            </files>
         </component>
      </bundle>
      -->
	  
      <bundle Cbundle="MAX32570 BSP" Cclass="BSP" Cversion="0.3.0">
         <description>MAX32570 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32570_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32570 BSP DEP">
            <description>MAX32570 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD MN_EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
			   <file category="include" name="Boards/Maxim/MAX32570_EVKIT/Common/MN_EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32570_EVKIT/Common/Include/"/>	
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/MN_EvKit_V1/Source/board.c" version="0.3.0"/>
			   <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/MN_EvKit_V1/Source/rom_stub.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/led.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/mx25.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/pb.c" version="0.3.0"/>
               <!-- <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/s26k.c" version="0.3.0"/> -->
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/stdio.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32570_EVKIT/Common/Source/touchscreen.c" version="0.3.0"/>
           </files>
         </component>
      </bundle>
	  
   </components>
</package>